#+title: AoC 2023 - Day 2
#+author: Kirols Bakheat
#+PROPERTY: header-args:sh :cache no :session none

** Results
#+begin_src sh
runghc Part1.hs
#+end_src

#+RESULTS:
: 2101

** Results
#+BEGIN_SRC sh
runghc Part2.hs
#+END_SRC

#+RESULTS[a8401b6fa106d729cfb9f901c651aae2ec295828]:
: 58269
